import React from 'react';
import {SvgIcon} from "@mui/material";

// Иконка создана по примеру из mui https://mui.com/components/icons/

export const StarIcon = (props) => {
    return (
        <SvgIcon {...props} viewBox={'0 0 16 16'}>
            <path d="M15.97 5.675a.612.612 0 0 0-.426-.398L11.05 4.094 8.516.258c-.227-.344-.805-.344-1.032 0L4.95 4.094.456 5.277a.61.61 0 0 0-.426.398.598.598 0 0 0 .107.567l2.929 3.554-.244 4.568a.6.6 0 0 0 .253.52c.168.121.388.149.582.076L8 13.32l4.343 1.64a.63.63 0 0 0 .582-.076.6.6 0 0 0 .253-.52l-.243-4.568 2.928-3.554a.597.597 0 0 0 .107-.567z" />
        </SvgIcon>
    );
}

