import React from 'react';
import {SvgIcon} from "@mui/material";

// Иконка создана по примеру из mui https://mui.com/components/icons/

export const VariantIcon = (props) => {
    return (
        <SvgIcon {...props} viewBox={'0 0 16 16'}>
            <path d="M4 4c-1.097 0-2 .903-2 2v8c0 1.097.903 2 2 2h8c1.097 0 2-.903 2-2V6c0-1.097-.903-2-2-2h-1.333v1.333H12c.377 0 .667.29.667.667v8c0 .377-.29.667-.667.667H4A.656.656 0 0 1 3.333 14V6c0-.377.29-.667.667-.667h1.333V4H4z" />
            <path d="M7.989 11.333a.664.664 0 0 1-.46-.195L4.87 8.473a.666.666 0 1 1 .94-.942L7.335 9.06V.675a.667.667 0 0 1 .92-.624.665.665 0 0 1 .41.624V9.06l1.523-1.528a.665.665 0 1 1 .94.942L8.47 11.138a.664.664 0 0 1-.48.195z" />
        </SvgIcon>
    );
}

