import React from 'react';
import {SvgIcon} from "@mui/material";

// Иконка создана по примеру из mui https://mui.com/components/icons/

export const LoginIcon = (props) => {
    return (
        <SvgIcon {...props} viewBox={'0 0 16 16'}>
            <path d="M8.005 0A7.994 7.994 0 0 0 .889 4.363a.667.667 0 1 0 1.186.607 6.652 6.652 0 0 1 5.93-3.637A6.655 6.655 0 0 1 14.667 8a6.655 6.655 0 0 1-6.662 6.667 6.652 6.652 0 0 1-5.93-3.637.667.667 0 1 0-1.186.607A7.994 7.994 0 0 0 8.005 16C12.412 16 16 12.41 16 8s-3.588-8-7.995-8zm-.673 4.66a.666.666 0 0 0-.465 1.145l1.528 1.528H.675a.666.666 0 1 0 0 1.334h7.72l-1.528 1.528a.666.666 0 1 0 .943.943l2.606-2.608a.667.667 0 0 0-.001-1.061L7.81 4.862a.666.666 0 0 0-.478-.202z" />
        </SvgIcon>
    );
}

